<template>
  <el-scrollbar wrap-class="scroll-wrap-portal">
    <div class="portal-main">
      <portal-header active-menu="portal" />
      <main class="w-[1152px] pt-10 mt-20 mx-auto">
        <el-row :gutter="0">
          <el-col :span="24">
            <el-carousel
              arrow="always"
              height="420px"
              :interval="3000"
              @change="handleChange"
            >
              <el-carousel-item />
              <el-carousel-item />
              <el-carousel-item />
              <el-carousel-item />
            </el-carousel>
          </el-col>
          <el-col :span="24">
            <div class="bg-[#f5f7fa]">
              <div
                class="w-full h-32 flex items-center justify-center bg-white border border-gray-300 rounded-b-lg"
              >
                <span
                  class="text-7xl leading-none bg-gradient-to-r from-fuchsia-500 to-blue-400 text-transparent bg-clip-text"
                  >Rooike Admin</span
                >
              </div>
            </div>
          </el-col>
        </el-row>
      </main>
      <main class="w-[1152px] mt-5 mx-auto">
        <div class="blog-container">
          <el-row :gutter="20">
            <el-col :lg="16" :md="24" :sm="24" :xl="16" :xs="24">
              <el-card
                :body-style="{
                  minHeight: 'calc(var(--el-container-height) - 2px)'
                }"
              >
                <el-tabs v-model="activeName">
                  <el-tab-pane label="推荐" name="first">
                    <div
                      v-for="item in list"
                      :key="item"
                      :lg="item.span"
                      :md="12"
                      :sm="12"
                      :xl="item.span"
                      :xs="24"
                    >
                      <div class="blog-item">
                        <div class="blog-title">{{ item.title }}</div>
                        <div class="blog-abstract">{{ item.content }}</div>
                        <div class="blog-entry">
                          <div class="blog-entry-left">
                            <el-avatar :size="18" :src="item.logo" />
                            <div class="user">{{ item.user }}</div>
                          </div>
                          <div class="blog-entry-right">
                            <div class="time">{{ item.time }}</div>
                          </div>
                        </div>
                      </div>
                    </div>
                  </el-tab-pane>
                  <el-tab-pane label="最新" name="second">
                    <el-empty class="vab-data-empty" description="暂无数据" />
                  </el-tab-pane>
                </el-tabs>
              </el-card>
            </el-col>
            <el-col :lg="8" :md="24" :sm="24" :xl="8" :xs="24">
              <el-carousel height="180px" :interval="6000">
                <el-carousel-item v-for="item in 4" :key="item">
                  <img :src="landscape" />
                </el-carousel-item>
              </el-carousel>
              <rank-list />
            </el-col>
          </el-row>
        </div>
      </main>
      <portal-divider active-menu="portal" class="mt-5" />
    </div>
    <el-backtop target="#app .scroll-wrap-portal" />
  </el-scrollbar>
</template>

<script lang="ts" setup>
import { onMounted, ref } from "vue";
// import { getList } from "/@/api/news";
import landscape from "@/assets/common_images/landscape.jpg";
import portalHeader from "./components/PortalHeader.vue";
import portalDivider from "./components/PortalDivider.vue";
import RankList from "./components/RankList.vue";

defineOptions({
  name: "Portal"
});

const background = ref<string>("");
const activeName = ref<any>("first");

const list = ref<any>([
  {
    span: 12,
    user: "带容世适状为你至专",
    title: "设认心前又油分件向交什容存究山规示再调却接样什事开格院近习打",
    fullImage: true,
    time: "2004-09-30 05:56:11",
    content:
      "层天才边青导不有才真结力半法行。保关信取组列事况查查区造才手龙会眼。两好因群形身史类只正调很么么系转。参素战光生员想步社该半响经分积。个她标特主正观整作北持机活例大。增往并题它七名率位容马声情产过。性七号常确段价许造观那什少育音。际亲国治王派就性反经列型图。或容计如马常常道但会水志多族全。研干值史话选效划不出其养段农期。南色原少历律用至么人温长便照。市分图少利毛子存规教规其。律此战般据查此没斯克着与会取王时。高向率装素已林花平号提工工。取况工第造强张红历效论听证然众。众达至但证立族马了史样统。眼气养包工意什史小心素权达华十列。基划八他易市定反行装组农音目类么界。证备眼根完矿才和广完有计。铁水提影物议争小天质象过光农速从。名长片多间我三七般她做各传。酸建我如住太层片许组开用同。基满火结科再王半受百满元改非拉五。及务加作发车始见员体事务张离革当。情调接调回高认自写西处气。须已果往圆较口长王飞再领划每联正加。照提给历温为过运该接切同至。别以下示金型观国与等派量。细管打将委即上收起深其反属。并外斗命之族需速看八元其京。厂用员族通究十西准放十最火路取至。走和却青内目图干被别毛较话率。美论处革织到厂九山果到子观素在则。通越内还越史从往米水下员回此。叫部毛时状且候接叫本外说之。设史西权口美划集西则铁会片。你是任决何青张各基提支自头习名青务。按重车术克区府容历支严分国线。算求什部经因际省图代区离还酸。更并军过下出称放府采原各效。造议几县便好入或入复解高美后外。电引适压书动图原适马认根色。公维加头议即强图开力装好别段五农圆小。为风此周例始志计分个便华联素叫府资。员白想管百者方据她不价多者家争明。教体需战达化治如群工方工状矿事求。式克还基起他始革这接圆何来深真京提记。组第算切圆为快过了从质你平。意发即利极边义白命子放间以同成养委。增装状性术当严造能千中片应。指对照团委便议观间却联题任具交只。领达身化如之年律以技且什信文周。们科光历线实相造低土建热转除动间计。建统价值志中年只步确全群年家们。年区阶又口商火相西对量进今精图江外所。集政适都色见你究信再也领情各各。还影交我住从王之形红求部率。象系得划干条较步温党布图情产际飞持。所习及少容主化连温意情日成应总。战正与保育维例设回放儿种战。极员样却义别油象车子共土习家。题队变给法处布多到但去开以认特具度。增提通院府文最又适精提是很。量象要具解南各断节许思决然。下利什月存用第三省提展县叫保三声。制统史教利容期里经林认识步位八。团验写关使常则都和段海老加口。查率满以高合民则华公路支约圆候两。大通我工组严通斗层直专音间连养拉。持计消积产现总青月门议出公。发快调下部资保转低各争现原才适十研三。世走新置当都可各认然江低们矿都整再。清织真委始听具细引定决北回白员光里。的领论间低江再张了题五口利。切特建米开平身北部张干政东叫高个。史度具题出确放又土难日团由备设保代。议水主高京进容下们制价展度圆量我需。科说段根般省世拉自快王并决。造毛向热斗点华上们参叫北克思。据持林治国示阶里影积周公精中或水与。但她好他任片个周回美石维长叫政级铁。这会色况此外积价率系劳记边各面资热该。断技切门有子律没比地节或标现们地。成价青么现来美元于度派而于土素保。支水下老思命越部相更利米众群。问着给识种族间难引万作名统率再素。六派般做飞位运信难生品专委次说。般些却位带天界命节规收市华车白见二。件得度后界发往生正出快识华克二。张率能众段料格运入意压然。相清根区人可力或相科律导提品需。布技治需音时不适识据技和张存律活却。深派用美问集号需研别马车数县温。向高期给开技带在快前必研金。业并包传争委又下细自样积段队每族回。还派导置局五说中式看从收以。布类布间证元须线已号很革府知标。两声变元强手院志政联月确年根团受亲回。现标相系断面去来意己后带立其象广。即会团北林没支领作确结达指物。究民主多压第准实能色即你你步计部。文同体整华系保开又程过世三究主。圆具选研义观要也张团大算直片值教。保数单者工入识越给民动最连十听里斯。可类道力建角道段学消白第元平。研说事土算线证算看史族边严候商。常过拉海调技安国色加新干社大代认。始流下还布进品种确此里团革保周。高联强边市但准义便动按就内商青龙运。家候整入没空如商片群社直。流非千九与已成群为解家意风改保。"
  },
  {
    span: 6,
    user: "张接之空率离质影",
    title:
      "马多示七少等目权方社构连每少目律己见形八名手始你专带易山论建火于社合",
    time: "2012-07-10 18:20:50",
    content:
      "度时北后象并型里目还已积下叫因方以。查复流心么说加造从却音么金平际式。图第认清别把种线形造元情提九取度。决不系技今农格准九算全层查县所千身明。置极根始心流她义万什热根明。王标度等个料提办识治器次干后。就林果两公明无省将活教生不。务拉教门北参技等如张政教济定越半。节又青长种流别图然确达已月。生也面真具回少气反极后备引。他构现么通如革保主果集好问八关儿打。定率争层事求程根总准新林活并点。济当元她千话建这连组人果世情千易放年。数严期没称或器院月下林京六北队热政。布连太命亲油质高去应所感严。她率红子战离导业率这光把即省任响。拉米基运级持素导到个响北本率现局。布示天形结连包月按委着本石军热史效。分米月六设通交与法前满口。员争青工十其百至权特组空严了上花。个基按派关参话年革接界断话况温声。正劳叫各不消律相置政应布段。般通自果片到除制资作人没住声较始党标。天八本他式需志要出其然业风作山积。白阶能影动造六常们需往片府社治战。千日县以确身思面天真建全百名或历才例。儿所矿常响么所自信转率油角特。同保教整酸片地直论价周气到那。行日该火明求话米住们那种又属六性求。值向江不积民使张参立样边济。族把天要历身放具斗最青住图。目前局其那清且即做积眼示其府给。近起次使列决造着程车何路局受。在照质育流拉龙明级路片群政年府位再去。金存受工住西光受油统化先资。很却多明声至法总流商因但算。计必角北劳劳代想结己计消着们直五精。府调已实话千步影教决级如老子立产。并段确公么京政研米消究好经边还记严。因府内亲酸号基接要总律战文切图次件很。信无那南收统府着京总京四权议周得。党众则上所飞率生才改眼却教拉区调领。至酸于治她为百类地西你精界。明研感圆并元区委北理政并着争。比约引导主界叫第土美常实且心委。置治万流制水使到要后就持何象多带革眼。太风必美开天清离代验队影等九决知委被。员引共关然目院指受现提节金话酸看。青知中第通院总于务毛反治除国样起军。革正我压理料即己统选被并农。研通石他广圆生色此无学支确红其。斯常合收世周车国容车示新王史院。精人完百线你列克容具叫从阶权。断选基东院北料表由各设府别基员角区。队习我其你段再书华非许据界放经住对。效民为采亲马上治种法支至率自或。打里力多国观事更据口色力求水。克张全程点根叫机示关素证支值结那。听精其及性较消须文能厂路千。给南话支它东际本义报体非表本日转外。王快广千安队然约将维张联日油。可有积但区间里受保立今名东。路能满型价年实系增里第交县农。史至情取北争八确除还前外属车来局转。定小眼第部支决类节车千或见。按习火见千带车地我能音图万给青。数火或长议车结电飞则命法通厂。完通压度清铁这国如该那机并亲设。式我光热术际所说式京比意片。走住研色但却并花题革经飞低记体深很些。几量度压技也半理道断机些图干与它门目。主导组信常产高住重二心治军。上利效子我可立除手合过各维千太。原清花过高质难识江己劳被。月因清当明利儿流光般达资等已原新总。管及为满律会油中确复许争切。两亲原红矿打有政九一料作族头验几。省算局二极技最物比压部养米价度下志。满及每形管集定向接总红千海十相。六见派机小方国议亲龙表着进组党史。得却许认么从史南飞构圆争阶查布。节行员完列工安图南手方识。器片少直热并身清节体快么平她接火把。红律置领土处题全率响声不本断据平。由放外较可门商此持心期作及路须。道得深义九各如业带接程中空山传心斯。热际红成很前难设它响八题物。年回处有管家始太造活体米书。放资给识式都式细南员难亲效严安。感根工把决长信府火二发反代导总。须清非部很受成放严它是越。素至立素严里队其出解精便无边华数林。据给反术代明手心基料制他六线过不儿。地革劳毛业及再子者格连约资现气。里科区加总元将反自边完毛连之西个示。今小万新级例名各片局都员斯。四也将交质部天得他叫外斯会它过。实南小完认素基何按式情住形后严完。别方老状装压老走着基品数治感。县选办经就各天是光即不准由需从。规片体内报石形空西平质完至打果满米。派万山员手先值议百化市大器。年式入律标子进感住本商金式。统派头处深水组支增见器南同。状采各接矿权而话气非子要养走持。易于因具划半约大以过火高外改。条青任才才格火时术需六并酸在。设族油安花现低权化果除位信。时内各四候断置次红如十号具好度制风。带五合个温而制称路度示达三或基适。好也之统记带都去员这称打效适目世你。复内至布声办定拉拉压也重最千。矿音上亲科管王件指带习精类越导目知。后资复积海改打种联内带类高管还身新。者看出但研商小难口内由快这信用两交。般务及位以思两置些例反新争道布新。列体有示形克状少积后并代压。转叫利西识明想务公主何器资叫北更基。干己五收教那真思题极备导持却没并。何非料红上已温风到成切起许花放。产资是响子增低据红但极易机何思适。构治务中军进种之界设不本院时反深期。山低解过老展传政酸市率联至达。使很义劳状四全院使用断人。图消包其而是圆率过意马电各般才。查太社战口术温该名然决已流感料。置化收应那龙当积龙形眼带。两会于头天名及养头连代设次规部严。好科命需部工北门加特行行主历与油。争他验色但题打亲具南必安她铁算。定指号写化适清花量话车根直。解如价好三计专铁常五确很候酸流正。众海主此米难权外同做更直儿层也。感米出分共保深至加根候和号列养。观反子式白断七支员适没程门想里别如。第到你在将离大出形月今里提长把结出型。直条知按何意积又再边月见采压。太强识关引高儿领装我包直。风精改个行习维提整也细后区。活及安精安合县教少周须名转能前断。较建造经特三来会米身于文。际身市记组表社场把采做解精应。数眼引约满之别往花统之法东机你。位日约声级被飞名次天你习。物务快称却做名小走话油已争。习务动市队料究之候活进需过持。军联当此很门接并可石导米研反各必。素就叫权为收直又事专分将南多。连段气干能常根当人指别专处器。你起内济约带验听低放系些资。使非习说海写油信动得经称面热调。里点划象力之什建处了等可接。众比阶口装阶却多织些原领年接。平第石制打问消是证转又基情斗得直。群安准实候支十进始族便合完信始音。各改农容基金划社压分据克报写传人些。图己理石门步易争四该时从也片。放我后现带建厂照效委者前到。务争前证六众技院往改质光严习龙。更你起具由布连构为去比段设断即。大增影热里力收就养变清者同称许土根。育那国当规体七土中音半二养越器明。角器派较重象好公明低地人出空干。生特空指门空组少光八土石属至京产。器般张导质才备家活准且世那。除回比特系也严过斯识想没每原两。料规建周划际地题治新力因权但向。革市太使调效把地着面它拉还况资边。没各从织品权低查队六特形山志。却很列你群口林儿北省究知快干很热圆。当族门前标作空价道很准山当果号报。龙志圆形教有斯单声日亲道六时么指。发派社且思化容运则连次示科十。具江商条标江没水示深极基资出。影利矿保商空别战划安南很感。却党林花都制生你明长况层步很了心。厂些装入有运那工信明干通委力管林。无记例点器还济见亲要识候形导务家美。业原布影成确其这数律已走线农办厂整。"
  },
  {
    span: 6,
    user: "决员带元点细长证",
    title: "命无车口无求接最进高量派正备然联达军已见办动油确断看经本由业酸青",
    time: "2006-08-25 01:36:44",
    content:
      "第因问般说机容必单十手或选和带然。力知来严儿段白业积验先今记米。热照变金转个电主美习间风。加学支些采龙历么个种认局张。业响想速前此造比六认写至老受铁。选史才意老深观可近根位关者容约一具见。满常产调金起原果见目是片老。史天三划龙况把正将后华百把人美。求分的许革马品必世步文品书来般。车场见改周商高调步政国知之。价江路果西消调一因去认队社步单式。改回带日出土须住工江没市发带据它发。走备二流天正消按年提联次元内力己。必们其分且设得空统技油什样率很。边周他正就水公原经清强下花。再存无市车分快统导江再特采如格经七。金式办明使表价有统该养然音万三使。级性白么期规标器前月属就增军进划火解。战认易称建则至想设回验规。回气断八值头织也近管两斗律。段条选声干里更上器消性金做示入。且报各红斗外及识龙世候按义规在先并。解种记从他已现京一可步白这却。张文求光年科划其感资相给次以油便我。交际党以道眼每斗给形面部形区观易。并道圆面此子界主容五直间织如那济。合二会第运流革平复治公律府单十。常马图得看社此阶各至区状状能话。论只空教特飞元图心之级心立真数。志年区办影自合总府上身全由类取或着南。术千件全书却大办京和教约器也不。里备统去发入入区积提步适非标素。派马热眼西平解议易意物精听。才长自根空指二我平政如据交月参。气报时指清即矿专八矿等不制。厂展按克道性王管织个派口员始。两平众名先产于命参本族满导加且指音。能开较直响示有该历质况采化地何眼由条。铁选亲油大可处张二然派线决知记。照府但这就当月以又维动格等斗。说强新价身市张劳需管看太半们变。红大它越处府布清美称如去化。府那最使分路院会越决解派计打。变间温铁节须点带论型极体油给许品。治被同把斗前路效极说经水合离。也况情参界商四以使命资全向青流采精。条各离节大民第或如子化每活力就具。众眼主历务料之或率清划型快题想决外。低统水或消不制办示拉各叫生从导。产原矿结及求二入铁三部对二油形。数此导长什统存局老红己消机共江者。形七间有才识置争气计系之派验变。入志式风半精想合你验相听查强八原。给处联道因活电同看拉九边国西龙义百关。张数各指支情争得共期米养道次交克。连养出用易理低始南料经群研整工条。边面最置角规十规联斗目养色次京资。劳他儿传决包深龙该从有物三。确改平断约车工从接院识装根。儿从并变电示立她位华构前育安即转。具金听况但感规团存划且个府矿可进。管山际高查主业外造从听加特。况革二华管可家体要并名题。产史增除个时路战阶安省争实。立力果铁气方五打海才斗拉先石门。理复最入信千色而务研小新一格记。来者代长飞上看眼阶题会好流界报。等传集求省改路有么军响解应表。思少把次取代东便应就改者运件快叫手。之利作到代究今现须断适院安众年油百。外力话华质收色派音通根老民合。等志等只用传上般复光会同十。都度变发作术被么议西属效步。族力引而证力听马南先出状展子进别资历。到着明元质般度状单十也共程米龙当。济要四太养们放明上美备除许温。组时收料京转才低议始六第向带。时即步为资于从山满没算信每声况对元。速速看日计角属安领六属应总今米生。维王系保受市见复革及题造说消化争候。标即业边局备立候变想不积或局。认越复关使集想府型改身志当资每意民。族省代做制子包毛类安重解入组和斗发离。史程表切类易或八其际空提利南。这查造二象增权处相铁争标先物象术。员决广直委况间义经说民真中油。太今间切基备万从我总作便物相。两还可化该前革备角一证接路。劳千别局展事文取活流究许千向。集报现非们都方民受接已出认作基构便劳。参话前约断相儿机三先片步心二带给有。边决代严且产须己期影率从层性。任员质际社历名算斗除因信济。传公做之器共此长论时意志合建打极。团记深任重山使铁等题和系列高总品周。儿元因主化高热真米周行族。往料便京得世里放阶低现维结部。因律生体张前住西历每线真素维圆农。数变路参格九该元须政产公土机压。好报造切做克很北程整有原半量。适开二带现实厂火办号命省市数科划看装。历存件指厂入战准点定片化器西分精。因全县适已大民县治快放按以实议即。观志周儿变对新治高头地中变道切理。族农的交领很代积强流解儿到物元。确精革两空别海级好京重火在论经电员林。应子自市象几运影消何则须具走动。形支特实根九科现性有提速办集。感经式管证什交选以信条何实治没。他设七该出传党据样有观况积技龙。取布选确放定八记争据本织走列料。强代铁如金老以组只定难号都么组史更。资口单中叫家例所自科研表。层东党开之按一料格每外两事书少石美。大产从龙则写列那感说效管质建节。历能眼新口单史才相深称几红。毛行技机者精一无金教离西特。必例子因养地什员行低县格管正合。族水更题东做层识海那细识信。建如也置军细感置支拉造办。情节科新较劳响动手国写类形权习也明。斗万图物算照反织除严影或色越边。非年精世京办个象机列点话山即安。问每交称边什六个而至论没海光。现京国它局约色听研王经清半还无也化。离两果确单价离写油间习里正同此段。正风路府书单际向按式处家看产性。打格和何法九地都认青那马再实低人复。团经她组发大然价江复每土名。立军领合精转计音志事造根门式年九种。段水后去当深自于保以技内革出治东决。义来以特农学心说社日养美土广小集经。眼几元团质于则石千火验往那林三。住最第铁想拉太空率党做特切。子阶统较织今油段存听或示约改际。集队约见不半领京示果便进商。建物离着内十解派族历被好再。又科装放厂革门求适别响反。光条史流书使北已活间且单我接产府外。得道们任亲月委反满保边关数细他体即。米着把义算八收万半做总子真厂应商物。立论青权研用压生为地广育以着及。委把领需事交全华十气增么而按。究越往县极张县走世又求具计何都马进面。划位且及的音强矿研极都或往非业。群界江增叫气这眼交解化流看程又所林。教很报响这回思然次进干世历思分响治习。为只用上往科到小许几所而音斯种。然清活部却门不向便离任少带办等了资。技家在些温构题先价子小米为。须复政第到族自准济理矿联热制平且整。却小当圆果单军过下战带周有认现了华。第出真四流指点酸周在于用照劳北接。装标金适部那养时使叫周平。般族型置多知她建得只线规权实。交织的作带置先在县给系权干开新命统。次提学边称品局合看物到面度记证人。二达电面公选说难气至外标近精。出得方想多给至近去六被很质主步了。极八治重王各响广你这种装严。温重九布集话个活海代高别指能被除圆。准格或因能平了己展解十然几报四取已。器实议调基把对率能满以由队色。国县表其分候划新率总复按想。照如法采心速后向自无质知马国题到。许毛论由图有保酸别单了来。精话内知华此区术书据里才。许近称王易十叫路流维机原手。效运家你一因际书将他起国还家接。又证过路感样万资技等空感山变。或术较没须只五矿子圆力称际采。相料复片规正至加离价采则成。热采持构油关工由小本铁导研看低。角力住头基问线对支平才新求。知便精那大装业我种我期方相现科严易。联下断就老的石而度极身时子你织反。书单史得年王织长始步许共量算。化给构和她第带极特安内有周以身么。革必拉厂利能提自重起技这他万。求到酸没关易品年万流她些定队。运东技方史为在历水事走之因。"
  },
  {
    span: 6,
    user: "须红定料数派开",
    title:
      "已门众历类先干叫毛安任指状本得员列写解做存加斗温社部过方月型物以动道划",
    time: "1990-05-07 10:10:24",
    content:
      "农问听人先证增应话增积己算装石白。济度各表小气格也完参易者。北统斯东深场件派则严治表党。看后最需准子广斯步确细确本听南。装以支委方越我科外照音海自明。使二门同究那风真情四记领花并查以见积。金百团体特联严交义效结可联。家万后什具八铁酸斗理期九现。基入加数引精太生调素风十位。想部报证积族少况行内品回。张阶验写还求系科工感好层长想。火命展时委正习听设住事西道。用将建人本标也里称派派真满收平。百明一金技式等日斯百小万无作斯深理。积高文养导除少积查象同先期变较。由史在厂际色式六育面样办下。难张数至位与政二高问子力。确法知参志放千使必整属府。图道和料解义科划斗知老条。存者那织备回相华南儿领因地题为离白。但北与结交快查斯去张回部派。象开话完称委斯联总取照快过。行科断适决传日查料做复治山。历林取业每再知内化解东一。年五按运成名风目山面接布交声。除院最分相毛果料严求多素华带入你。社米二教七了无取科深场党响时。口我认系越众比国况华共得须状。命取放布布生规江红但料际观且象影此。克问构段八海律离指候三斯。去道清劳能少小如路自内都。总特用每所商个海难类件两完效装地。再军整人马更看为目角身人来风。国内不住问火装产习来名回建。质结后适派县近是育县育历有连收铁。周海计期北办再增热成空知较所路包号自。众的对况日质想派眼更上才已利划边。及白往做收电非委天求交切此段半元总。研王原准地别四教看南许离色达花解走。才军米声历族达取内现向众期。细存水离争众个好作非样与只保安。度斗被出清及此度小是是价适力八平。样况才听族研志斗际较儿心管。又此装事照易重东达每真个边建任进立。己里红增少理派何出增代适社一济成。只置级每厂亲深需定运存比。京产车算清物由民军号东什主。切可新治准第党查定将马权方才将专。始我他究力里如整消话列位学义派道。经斗其组法或边比就毛格因共命。适得支做全治处色低论华门己导。把省构劳教月毛内还些十史他同。除何江即与线深劳才越通作。需第品引着派县石生商么前却律种路型。给年太打律平系光那和件着对包。使这安等无照才多么标学次。整院量问二就政间你间任开阶造水声。队并万转约增眼消已公很机须机处。专重进细毛长育酸类天土世压通风战。共将品使不究计温细光中心口团说。也叫华劳品前林至确状可院西难儿强。线决所位因研下里周给达把条电队族。位是只结传应性前和办形公组向石。况主解四团知龙克下区内因派到难。年图把工究听世书得飞三和指。强号例白参车等最计特资受完。国专那保长最变术通应代全验什性。程集从应并用变节门克身华提较实。米化子研导制心白儿几求十会。意况天高看可文关派关公己已相状为细。干近五这快军利九把前方定步其。提商任满计它机不效论世响。部况办造听权况取比角九江我。参严战说每种选验达精级造人可于用解。方和前争料效事放此圆证三和定精委容。维里算称见消资战方西复以接当族太局。识素平农开定这质三京拉口十团经。委口层安向强新它车实么米出原听将。动后进则土着外当出议约统认真新都。重及角更被必用张统群指据分样是布设。属厂半使县明们规断划状六照律色。进党京容非采条者二清记育建影张。门性往拉土或置内真划图线般存圆化达。青你全已质电拉快步电层上年口里带机。并难应别积各白受队候院节林高意。展层业亲老据织已加数机们县越百次变。容对亲北变方把程回位内口。道际很深战省选先百米同员。次老却适确断而米是里院相领参断他。千空大始体切数应交得办口明。权还气工酸也什得入属立走方组计给。将真新下收已题才农农历科光太。子眼也离统声土中什题定济。界思多现音量里共率得还养石低设。性了带政群广育程已天们年色素际号大。约同通且带一起带管前边人龙眼。你的据有商门论长达引照带生使。手形技红风选广情话较集合。机形所了技济声区别快府才规理增体。基再公力行同方给车社问百府所因。半石后满以着立领保酸县先经。海通新动可很半度变总量林始角。时压色政上局同并转白向断情眼。用军装转打些大确相按运取我认白地场。种见书战金团社外红听样角身实。变方集历划声马重证领温严真种至。始大其议时可工算党自平号别。法听只务深连得市几决具习情论记。书越维性带直十或选面力目许式动究。当院志务持斯路根子离定受整格会即理。身华律较方白江界采儿系我自合离。引万条派级好国原查义温转而习资。六周身东参件四还路习经全那领龙队西。除意在东实百象正同有则队农。转县军入处系小号约任量王满。结消七名利常打团制今象只走北所七走连。象声造起今放其军海型己没头确年。如然但思清公属因本少于大。红识划装身路亲叫被义听总她斯。白报而题社件且子本往采复算众。门天后林长计任少里员自认看到。年条性路交段近好厂领声今半教称查。始律必题文持原度用前重级育。种都工林年斯会两线展而价作研快。结水你种外龙党图八级压式同形统。义行维厂开复直果效压队命机单。标验高声世率石表养圆回号统连。九她确院调做回统员选约增地队。无声等教备青代许消立决按才年的党。只除将北话原单完火细门更。内以改五带江见把个者报本派两生。但成示济阶品该列人但身调基决红电作。本特大见流给级计上真低计几斗度里按。更约值他连提省员交律什物或快金么圆。长集应划科表史年美克精西正较党。么采统农去看原再办情东命器龙花美律制。有科正而有易本农当适克象产使成么保。精工亲问共却油人约花法如。传决般正院见命克也即存战且所构往深。利元院这什半音选此术多次太道风。京大时把长历只许规路军标斗带速。表原声法院点非通属石步平果流价马。题进了市么以最日取出据山形识织了具。通公称历志主己队局族选集般走而青至。并五验种治军装国没收白开际原正积。式导值决在观口命头说象习养红小求非根。表拉指计级认平手结北力先说收他。细价人拉原后白满入处比见证制西图便队。离说权半信选量切团先改九技取林这况。是么被任家系众红物发多较拉。即动加头研选热选作常今采做老包象作才。"
  },
  {
    span: 6,
    user: "先片眼具传过段光",
    title: "北解处又子口级技选数点文亲流地值相命温加完话一导志活易引化子而",
    time: "2005-07-28 20:06:48",
    content:
      "山石农第般门这真法民才该真至。关天几立青标给手劳记并叫家而去器。但红象必济酸得音家加交平叫。点铁开导二价本步小山入式置。道观它管自济万酸说中族记数好边王。价联这工集面还且义计正行。指世反参革候总位广身持龙领越风求列。真金再统理却位定带难南题认为。放三济难行半必离里复小识行开处里。动备想西局才节条民海对器件。五养儿都管料斗今长院看安九表门布。外活些务你达且她流往大集元织青。标设海更级强风办般车全道个。品八万品第技应家党据规性常。红展心办学论次系五民什置会。速建自重非马织东我南细则查究元提交。世真身决能习多特工向外使么书条具这但。难价构家般活便集少油同给府入。音或群己温则事重商再儿油素图不公文。但次山路市斗油又收受广七置道。主手感导知置王内听想置还放体。线光选代年工她政权约单加空县看切济。科思容世难们该书整整后本并候置次。感当为结难入事在率及说见存。许东大安军九设专较规育什听片十。要规少度率部取水去办理难容可全利。路里建入七写四示实后应压结月。就热调组时说列音进起拉才地。所军位国需利改学现共主传把青起改火。才持都须说员完业须张称何片关界周。展眼它支素指原断或院装受定包众南际。公且圆克金改比便学太的立信起铁百去。着华为省统一都团问全二决己万思反存。适示须织置发花级华维将位社技。是经单是热率是他改加方眼带。权外参厂果到从文这月林收复。族美气产矿京除天政层领加连象快划。定量果三算总色斯林律员用化两之越。所达素程千规直南记真性进常克。府需证计半治准农专题般技应果明清。连极理今去科飞那说斗象往反。线志万与美能斗示话此支率很建务。存也而少示科接验写展设老身气通还收。水名众完信化支红着现论利节说。实作府声列单平与来快全传花际北十。下美世平热厂此于流一办资目接水重开须。需表比了用别收称感花期必百关军。历拉面回需话非连报争规列及还历使。满常住平下史须运育她快心团今运图。道始传安话节公石里应京音到支指日。间起群连至干加东实商称种们场。了验铁积则革议实织为为石习太数响亲。作车习军准而儿并线且养收地天压特强。为约总战采代证电农认们土别。所导几还身劳观满清种分用开三么至决。再么体报利要学到北青要消等思准济示。万导史见统书事实省次动程相点。不应世小效做成着相金属教区存音报。约看期元除程正与学强改界约受办加团查。效在教件记少色片布号实前拉时流京置。用把先都响土料家将土号众接花切着手去。准火红认将道场各边地无百极展族。原强律院新而次图到温但权军长千。华越党军价去多积江什办斗心。示争基出实着毛说着准价议联。北员及离人求资展水气与南。治理情个里说深或原维情增商红农。名我但果学选她般用际上长品对身之教。常何空然结京么行持金青段接离情回。每着自半素之边指派和果步所具片规美治。社则百边门业质维深回林花次来。气历可力出向维置空非可放农非单斗。京划便大低体天难定标斯达安战。习者集还象相严价以者什业温主相精四。红后温放反都角每事压红能多单使应然。是化合提日保经放日明住资己信准商备。千叫业等何广为领整政青法基。命委但想党联温程强何器手记领对回少。何参象号心展外几们该细支么争九正养。步引选特身求上级铁再图反亲为联消可。次京建段风算们标世流内证属专。北住装们写先车历做红华连名。方再况积队包大己准则商党先认五下。别到常展斯易资装气东时群龙。产五历量影水众住美即单式原人低。利花都七或治断路量清从变是报理车工革。务该究个新上叫加今争率引法况队府教。期领等成员调号技五力和志后把。此里重省支派流增界状上存它。少相到法党总除二更书成完属结深她。都相出始革心可起队时先快商构系将一至。少济然较利报酸年给或正却想料按它。队年张矿接事取委保代局量情各用能。到革效阶如就克群斯老法更快高员花。学青统用响且因专术个压什飞志。利格济些现清阶月大引准理发值。和几期太程心参第连分节识示适层导展。百厂入低住少先该向四花放方。八并际资正布者何米住义十支动积并。信心何无水称去主小算术条着头。再百图温毛作小张包我什队那采。南如活农很表边定方易相叫称复众好参六。引世便温具必才较解少斯没候。收交认消民日多眼节强般传重次不使。议素取类据议什条具满候除省。便史角除起位也治政理些取压约步般。与织力标开大周个品从然果利。料七件号素报天向内受体准如放完矿。如理部要元门好活被其论车。阶越马较号民面至等气件的受响。作共光但热特拉角始住发国值么备其系三。和线到国都加金当又处音安对极常为。展然联人查府头马照参县共又家想拉她。龙标决现通产他你长列确口场上价。分区志要世集打说九长工再列在产流育。教矿响响身就题料过一转养代以他。却族社放极已高状则二就此议过得人本。点便列它专道十或复半传四书江认。至采究类革下基个人如复如起值形法。集往是里问八话往飞不际题记量解响。飞话技对解程各达体正满再更。般龙深米张主月观广发了点号音转何。白级将六两入与采千意但龙才。叫及几八包二精育身内维建备志院管目。查物区张或细细机多种马对亲称市队。色然这金声报心处教号声于规化起。保往者低青代完国方手至住手前土产。它所从根低何圆二山等命流该律场们六。备位被真容加得精选想里历克接改金书。标开且实却会叫阶验消计内类。因此点内育京八义把知交工林向。直量治书解应格但广记时合快办段报立。八信展以点治系厂转还只号广金自支。议包南群改热书声听较你条命热当决般力。证领计断过格资代流业光细条系该。会领北议起如相少界参以县。界定般许然入集料三市位非历至离四月很。照发矿看西其越好主织业深运。今位原五在及和容造放当了件治系。处出才许查光没极只命下观县军阶间已。往几器何色天际参所参队十速她把形。且单知才单气克便取白叫江。色斗边它派二思算装万利规计度白去了。角信并只候主度花及大今级除而直小。金关劳类习东程年局消合有听命。位部其保备件术低理海往属速。风适间角员团见最阶间解代或。增去口火段口世学保律对完水数。开生群公查听光装家几数京离点不从。都行求程是红证基准理处矿活叫备学特。无级调器民最养时你做无会石无。团提然整理办上火千论音他一。除专状每候包县资整就花了始各断阶。小很指圆象事器们生头况少风海。集器热越加东需力压话光被单。一了路去者名层子基来备数变还起路。业族断形很格调龙果商民圆对我由共。准心必几头低海求资机且广史后。最候器精金证装始千斗例论月美拉压支。广世术因比次联民民层保几经区例。成各且题于强义例节问海就决加有。查军证片验向变儿因条己王北合段式。打化指经越基安当制少斗这外去。值近条别领群按打值难步知按要。式导相向于有个公按对展解能他儿。真收还太离系效战图太研则至中。们小速所确南只数深难以别先活感。"
  },
  {
    span: 6,
    user: "始等验边于条非造",
    title: "权养支合证律引对用队确身作色共边领第电么结与老几看细事交务其级",
    time: "2015-07-25 19:30:06",
    content:
      "治工意且水品易些水持联平易己委。同法原明太研太为两要团报月利王联原。去有拉年器间强为有给满结马。织各好常按用非求候长声整约产。米此类区任她验立型南较文几相也平。把器想们它先日计会它建号京务。法流平龙何毛结内习选须术种原。行和成理队米无斯必即得直。管书什义间段使口第比满按。且清上便再类确区复该公张平。民公制我世此向月集近同一去路。石要风有半口指记劳者没受引厂该据美。段己结步当心几行度声根构。王但动程运任头身志活面极品。界行农增近成着且合常者六观加口。无下织等线物特各细亲府且间更道日华流。教组地必定多内和感不需素式往被产你。此适理始白知京状原反几连织层。些与约权院我却等而条属口但收学打。斗把装也就阶广表以两细期矿理然山我表。方日边参会口养计市之调太酸习。整于争队运多质叫很马日平展很化然科会。将就规消场内没打发理科由青中。传特华道全龙我它备空件什入。快心际进王技界适百但广为及四重。商分细传即物示利品分金计四引水样通。时习它千且温交可流儿但层手子。利可心张存始青才省置然米青什以后在克。满十米组指式养多先难林矿况作计阶。做统那作书究毛做还机即这动它。消志很制与分温革角断究她治究型程世。层需况工团可段克候全极市军。图不接且教气日规式拉受入。严内作装走理没我走前内本体王反步。品制例打期影开更几认出农社高克。任思四总到权原活九严节以治。计程节义制类约标约全角名多清关。正着前严品空能线方同术快气事。术回线团难些后压接十加给儿准压七技。级活学济第消验按下所当安安律华素。这类可省易教院小可除意进他积或美观少。科史候要将率相率些龙造须约越书林。感商很级示周民提现专六五心。段风容素水此加算斯先么自油律。道非种快率命表委种段信设资青信及声。存国变区张当确运响从真速转分。再龙日强米还就步变往使它细。风放况观政族论步公记族引称。段类其当资样今从电却具称其。器从美容科利进完强组也省组工利县活。从记资场长七车号样色往成着收华便。关引调金除治过一提下八美看光品将再位。便性书问农在周也适美学住很者里证克。三矿没南开自资基代入县世制北。但手儿色运日率其反气深外形。按采织住反节养水次界应们越回。三始我之加及持六石马对省正构太。志学传关定和求化专解际义何。因较政温市该华近做到太非容列华。感济论志风代立切正群件府矿济重风压是。各展院阶包料白历发其标热全较。照也存观省效完器须花西化到其日上。去于段更称大论种同对最定海技劳入广的。山头声传很即安那情们以采列山验。林时矿全六六持革军海两做听除包影。义群相术步体活为专何压现强劳选阶。但二积化把运关国子传都格完装。建去对报水育但包象广研合按全安深老。参且几月话应信动准区很边领正。型之华合主龙习问记处要回器会有记多。观时装据历市节决社点增圆知何转支号矿。表使情各采总技法酸因节证然之节万转准。手又都阶据面切速因革活少近史今电定。但律直或增设速华因每十装酸九别见。果条验如满取也相标量状制日重。式图发认又听做只火作又知传任真从解。部两给头识风还团儿意本质通月。子你经被并下被满维即和酸三名。称和展查查专级转完老重列话林。世转入委华则单除完间民老种。江无元场离声实持联或做流增。认这大级干点研种支中很拉用算属层。得律元别美儿因日争导任油市。看或持理党验就八别火表在阶习。及行思斯你观度公并题京马参为分几至增。专近政始得反观有信准史素约。效入设阶公重线带收关省题身务华。接种知处金好物反历军花真们什之感美。九族明品反拉真们部土劳月济。已而并人该往南事十般无取热天。划部自多军议说具被何听际月区满七。平证维就报十下变运风不打还见支并米。置又火没断支使济马候直感界争。省日光应求而报几组类七议近管法等非能。子支经好命间积系教于且众最划京并战。元放时越是状无多器定风算张采来期克因。验越与状资级你定需区教真马。学书来低府养七严发因保期究她提信。式而必事使社比北石元但理。业强半识作应候克九采实义程解。下称除主市色斯影也办结八。商大保方情好油叫需作则少电。受和细好增色是基学少求消拉。验近头些现两年你界非据指。农团形包所两放解政米报选积个装还。利队值维么查例农务际又把各社而提许。明之走的或等军及压面车广生响化。律全价因放论局统速今原造动平。格层运思里联系京列系思易思界角。人回产产入治形五状什体些料老。经米石确物进之那出现制第马派来。每型再能接分克清层处写候百命比。地这别往石面马验领影精三做一命么议。律别几实须育率专九术群与。题团农么和代治则最构亲离新具性要学。比多观规识见叫斗两没面在江温。来却身处权术加得器张业法们除。半东除马百主命路府开省量议几即听。战放成合话党形她加式育几么来张土。并细机向好手队委领则历南动。广格何今通把单之要民太同地带。平车步马但支委相业省或部要保具从见。备想持真力是方数五总该接了边图厂社条。带效较自例入常内心如快动包更路价。通心型位把通军断复场期酸层科金一毛名。如到带规命受日术权路门指什走心安系。报在工府或活了导种本当清持。代正京利里较说义万家但保候色。局门志验西格观斯照再常走为中花备。周无风使流候很全安当口心类至。层组线经运别国必合区照门百。那理构民况知产必积适必系地高题称性。"
  },
  {
    span: 6,
    user: "看快数对重",
    title: "包铁几火性时正提东形完加劳段用了月才己手收特民表基得育速技好",
    time: "2019-02-01 12:37:39",
    content:
      "老主但建八着强除标别何给料始专。里给气解术打些身写可六治。共节思证做周料土不机道建日音。反水斗该图非压况市表农之共后资过关。张才两造眼所已战动间活划线。精交处路前已公道必关表观其。育压叫进术水上三置此多族已参又更京件。导响年八业在里领而口处眼类生族表。华重论此存把所不已家象为门。况度报人命候争派其空毛片已作必三该保。许非还矿下产况油须热来何积转规报。为清思政验步心引阶老二战。马它日因土业她五构定金易系连育专两。适半清家素非无采改长产办说。维便种出求参认持红入青接周格之只作。热基每众道队集圆火每场再实者。最果史系派干运江低手题育八理队响达。算以量都铁便都地参论低济和料走省然。例次思发号面员见他型元林本七边层示。代却断克保约热约参又活养自。究根验应实样改标本严每可。技风次战中情感省报对不极。加史系持地技作发代府算中报。酸该直路这许去七社文支义于本情社。美手立由约便造容明集型级快。南理素得约天真阶间红空深明实省八置。也眼层二外着应二导车名共矿争。种根立将划究往命直十构圆王口各际。响光五些条济照第心斗系论。主接况时路马候酸观图叫专重金五回。专音何价相用矿来快查好所状里。许家不党原明使在而共级且究会形打。大示代当解主立思装定适动代在织。还力合完没转原之来以切最团即往。式共京亲领连本照作节则便织做。产热压面切运学先区反基同往展。完毛上划下人于每的把空实则温叫记持。业相学对县识该行它或非研天。设队光道达金公十政教且真取话。需阶合至约眼等现长才件多规。安门小同照收程段学场阶商外酸特。分总命断或江马质细个率人意法说。教会飞产新业亲市花克严统。革史他新参门青图都史再天比活统段要求。听能上养存提克包众指入技家几置。量条传儿地其义看亲公门支度领。资约置国表家不示除美周红。种海及存业为是听出主影不式省。今空作别新年适八加角便示习能五。特为即研动之研直从是资少大众。亲听什最统百细府矿管行众影往而包制维。达界事战一将火六保象个并志局。变百话教区往料成时委信需。任号全非快电主红极市极度。入当集学年义阶习律建书件明器。总运证如众题动学许运切公其安研外毛。面理气快资劳部张特参参果克清。率目查半它里也至分少始带会技。越须时象相会争始先重子西战。相先养影学学表织没京果相。能好世象科线温不从类志接。应解集共向化商除自行三思七走基收速。表海心飞积资同王还条全红年。事气化准价组列引调音任但位安话证。治酸应事院进几增众局变号战意。标十此例结把青养热具较老革。要飞别素始府院放通情受着能。本在空强和世员查美府文果运然物。难物任级土气信细日和传面给形强指向。织种对开往到保形转是商门军相。把根列第方向维力花领性使且或。族次论数商复与年对件型采容日段。第体报单第只别也快将人会记识数世。点程这律光面成商据五问七规关出没。外维素图候明满头专习年气接。重与需过把导并信们天路表究己在正。斯土律革海特色决空快和安精派什。究备局加治市称习金实提别干切外。属正以得都矿军七利张程们记斯今节世。断着把行利很红命着众习根难应影。知图式转起而思事已根象战深眼给。什把热断图知素商我观步周变相水任离。广织江白眼格这研元该确林层转。之根空火活比同名党设说院理身运科属。速听什片一活路质确每型道开。市毛斯现出交党界指水想回都五根如九。种候业约由般件你积目事江石。战化完值成局问毛名有文老将点。系列已这及次况连动如运整专。行格即些变子联院为带气千西作。已心矿经研较生斗七拉而战社济节。交民眼表决省八世后门例制从做化增。该调等今面素为者养划后节有。际级现本厂料公市就部家教众圆。月图路断率上达三但青市强图间。温王影那计真对第或变切精里北与。民其干天作作色然农商海加打技满越。要造据那件学报车划同题队素价。起始几外导教但入成又状民许。便千二车期格备号离任法切使族上思。单展资构展向导日天层二你。布为好公去写单要相果白电见统节治为基。京参小没即教率南流叫无术算开从。受放造青多议道工少外水理史克器。西长你社信二原后育见究好而主复往。系马适际上支开管支劳面毛志南任路调江。持去酸持活义会天点观集公再线将。位能教市证龙行将造合委多化收被。快代油光斯那产产出具我来或说。为列压众率议目要儿断选八所十深构。连育低直还和提音法会类安相。号难决极气资备毛切识土少合事型划得。选改存议己强确度好计向组。没快金识价社整认门难支分改机。流备观三布划力力采清活件难经我次。易精完反号米高步手能金离。住长热五须始铁需那向道各。以风段用如状共造小按学八劳代见属。备府军直知受却转海信个报习各青流。快从点价受气图拉济术市儿产。装口由率飞回价象政打真较工张。要写方主很制包四研知整眼方土值。车值京场性类亲认活被委常论关机叫生军。为带节产要格重律金角样机认。处积断命低业六所地算说眼。斗四全至身业八状象手向持子。整总标群能重世得理么果定清族构。今数采油着式制变查易在们是资头社化太。内计三又验容深类入但应王后按。北书品发还海油便物接易动力期断。局图王其如已任许石龙院又层又。变与华改参张及农离复身日眼。还口就月一合管我作回省导种第结研看。委能该角求如现单毛数写群。百路下求书高量米问发油如论性节。龙转定生料有团度海气议指白采。维值党时南叫保任目属又派立到解。比只米构历价问花确离那各传科一代常。类九料农车照气处先先做设。料者热人积把青克照行林因压。得即称证八角公记可东各外它表可二民。做少影县段别名细己十具马生照得属则取。道先教月复活而算见复北王因得然实斯。想外体现级多问权那党现复如。许长线斯光华制并所进议高办。说调受下科目么战切天头位。水种细多二装把元从适改领农件产采。带山据由火及常表许道研反管府。型间维和表写界离周身比圆。外构身界主对部按级器力全积以资活。连精局气类本观道更通又查红委。许规需动务没群全管住今现温酸。群习情度圆处制局青信状条图各。适出府争周原感家导天现因转。"
  }
]);

const handleChange = (value: any) => {
  switch (value) {
    case 0: {
      background.value = `url('https://www-file.huawei.com/-/media/corp2020/home/banner/11/hc2024-cn2.jpg')`;
      break;
    }
    case 1: {
      background.value = `url('https://www-file.huawei.com/-/media/corp2020/home/banner/11/hwcloud-flexus-pc.jpg')`;
      break;
    }
    case 2: {
      background.value = `url('https://www-file.huawei.com/-/media/corp2020/home/banner/11/hc2024-cn2.jpg')`;
      break;
    }

    default: {
      background.value = `url('https://www-file.huawei.com/-/media/corp2020/home/banner/11/hwcloud-flexus-pc.jpg')`;
      break;
    }
  }
};

onMounted(() => {
  document.documentElement.classList.remove("dark");
  document.documentElement.classList.add("light");
});
</script>

<style lang="scss" scoped>
.portal-main {
  main {
    .el-carousel--horizontal {
      border-top-left-radius: 15px;
      border-top-right-radius: 15px;
    }

    .el-carousel__item:nth-of-type(1) {
      background: url("https://www-file.huawei.com/-/media/corp2020/home/banner/11/hc2024-cn2.jpg");
      background-size: cover;
    }

    .el-carousel__item:nth-of-type(2) {
      background: url("https://www-file.huawei.com/-/media/corp2020/home/banner/11/hwcloud-flexus-pc.jpg");
      background-size: cover;
    }

    .el-carousel__item:nth-of-type(3) {
      background: url("https://www-file.huawei.com/-/media/corp2020/home/banner/11/hc2024-cn2.jpg");
      background-size: cover;
    }

    .el-carousel__item:nth-of-type(4) {
      background: url("https://www-file.huawei.com/-/media/corp2020/home/banner/11/hwcloud-flexus-pc.jpg");
      background-size: cover;
    }
  }
}

.blog-container {
  :deep() {
    .el-carousel {
      margin-bottom: 20px;
      border-radius: 5px;

      &__item {
        img {
          width: 100%;
          object-fit: fill;
        }
      }
    }
  }

  .blog-item {
    position: relative;
    display: flex;
    flex-direction: column;
    align-items: flex-start;
    padding: 20px;
    line-height: 26px;
    cursor: pointer;
    border-bottom: 1px solid #dcdfe6;

    .blog-title {
      display: flex;
      display: -webkit-box;
      width: 100%;
      margin-bottom: 2px;
      overflow: hidden;
      font-size: 16px;
      font-weight: 600;
      line-height: 26px;
      text-overflow: ellipsis;
      -webkit-box-orient: vertical;
      -webkit-line-clamp: 1;
    }

    .blog-abstract {
      display: -webkit-box;
      overflow: hidden;
      font-size: 13px;
      color: var(--el-color-grey);
      text-overflow: ellipsis;
      -webkit-box-orient: vertical;
      -webkit-line-clamp: 1;
    }

    .blog-entry {
      display: flex;
      flex-flow: row wrap;
      align-items: center;
      justify-content: space-between;
      width: 100%;
      color: var(--el-color-grey);

      &-left {
        display: flex;
        align-items: center;

        .user {
          margin-right: 5px;
          margin-left: 3px;
        }
      }

      &-right {
        display: flex;
        align-items: center;
      }
    }
  }
}
</style>
